OpenFOAM-v2506/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication $(getApplication)

if notTest "$@"
then
    cp -f system/controlDict system/controlDict.orig
    foamDictionary system/controlDict -entry endTime -set 4
    foamDictionary 2/T.liquid -entry boundaryField/wall2/q -set 'uniform 1e5'
    runApplication -a $(getApplication)
fi

#------------------------------------------------------------------------------
